x893/STM32H747XIH6-CD/88W8801/marvell_wlan_host_driver/88w8801/sdio/88w8801_sdio.c
#include <string.h>
#include <stm32f4xx_ll_gpio.h>
#include <stm32f4xx_ll_utils.h>
#include <stm32f4xx_ll_bus.h>
#include <stm32f4xx_ll_dma.h>
#include "88w8801_sdio.h"
#include "88w8801/88w8801.h"

#ifdef WLAN_SDIO_DEBUG
#include <stdio.h>
#define SDIO_DEBUG printf
#else
#define SDIO_DEBUG(...)
#endif

static sdio_core_t sdio_core;

static uint8_t sdio_cis_parse(uint8_t func_num, uint32_t cis_ptr);
static uint8_t sdio_check_err(void);
static uint8_t sdio_cmd3(uint32_t para, uint32_t *resp);
static uint8_t sdio_cmd5(uint32_t para, uint32_t *resp, uint16_t retry_max);
static uint8_t sdio_cmd7(uint32_t para, uint32_t *resp);
static uint8_t sdio_cmd53_read(uint8_t func_num, uint32_t address, uint8_t inc_addr, uint8_t *buf, uint32_t size, uint16_t cur_blk_size);
static uint8_t sdio_cmd53_write(uint8_t func_num, uint32_t address, uint8_t inc_addr, uint8_t *buf, uint32_t size, uint16_t cur_blk_size);

/* Function name: sdio_init
 * Parameter: PDN_GPIO_Port(IN) -> GPIO port where PDN is located
		PDN_Pin(IN) -> PDN pin
 * Return value: Returns the execution result
 * Description: Initialize SDIO
 */
uint8_t sdio_init(GPIO_TypeDef *PDN_GPIO_Port, uint32_t PDN_Pin)
{
	/* Use the PDN pin to reset the chip */
	LL_GPIO_ResetOutputPin(PDN_GPIO_Port, PDN_Pin);
	LL_mDelay(10);
	LL_GPIO_SetOutputPin(PDN_GPIO_Port, PDN_Pin);
	LL_mDelay(10);

	memset(&sdio_core, 0, sizeof(sdio_core_t));

	(sdio_core.func + SDIO_FUNC_0)->func_status = SDIO_ENABLE;
	LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_SDIO);
	LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOC);
	LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOD);

	LL_GPIO_InitTypeDef gpioStruct = {};
	gpioStruct.Pin = LL_GPIO_PIN_8 | LL_GPIO_PIN_9 | LL_GPIO_PIN_10 | LL_GPIO_PIN_11 | LL_GPIO_PIN_12;
	gpioStruct.Mode = LL_GPIO_MODE_ALTERNATE;
	gpioStruct.Speed = LL_GPIO_SPEED_FREQ_VERY_HIGH;
	gpioStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
	gpioStruct.Pull = LL_GPIO_PULL_UP;
	gpioStruct.Alternate = LL_GPIO_AF_12;
	LL_GPIO_Init(GPIOC, &gpioStruct);

	gpioStruct.Pin = LL_GPIO_PIN_2;
	gpioStruct.Mode = LL_GPIO_MODE_ALTERNATE;
	gpioStruct.Speed = LL_GPIO_SPEED_FREQ_VERY_HIGH;
	gpioStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
	gpioStruct.Pull = LL_GPIO_PULL_UP;
	gpioStruct.Alternate = LL_GPIO_AF_12;
	LL_GPIO_Init(GPIOD, &gpioStruct);

	SDIO_InitTypeDef sdioStruct = {};
	sdioStruct.BusWide = SDIO_BUS_WIDE_1B;
	sdioStruct.ClockDiv = SDIO_CLK_400KHZ;
	SDIO_Init(SDIO, sdioStruct);

	SDIO_PowerState_ON(SDIO);
	__SDIO_ENABLE(SDIO);

	/* Enable SDIO mode and DMA at the same time,
		because writing to the same register
		requires at least 3*SDIO_CK+2*PCLK2 intervals
	*/
	/* In addition, if you keep enabling DMA in CMD53, DMA will lock */
	SDIO->DCTRL |= SDIO_DCTRL_SDIOEN | SDIO_DCTRL_DMAEN;

	/* Send CMD5 and set the OCR register (3.2-3.4V) */
	uint32_t cmd_resp;
	uint8_t err;
	if ((err = sdio_cmd5(0, &cmd_resp, SDIO_RETRY_MAX)) ||
		(err = sdio_cmd5(0x300000, &cmd_resp, SDIO_RETRY_MAX))
		)
		return err;
	/* Parse R4 and get the Func number */
	sdio_core.func_total_num = FUNC_NUM_IN_R4(cmd_resp);

	uint8_t index;
	for (index = SDIO_FUNC_0; index < sdio_core.func_total_num; ++index)
		(sdio_core.func + index)->func_num = index;

	/* Send CMD3 to get the address and R6 */
	if ((err = sdio_cmd3(0, &cmd_resp)))
		return err;

	/* Parse RCA and send CMD7 */
	if ((err = sdio_cmd7(RCA_IN_R6(cmd_resp) << 16, &cmd_resp)))
		return err;

	/* Get CCCR version and SDIO version */
	if ((err = sdio_get_cccr_version(&sdio_core.cccr_version)) ||
		(err = sdio_get_sdio_version(&sdio_core.sdio_version))
		)
		return err;

	/* Switched to 4-bit bus, 24MHz clock */
	if ((err = sdio_set_bus_width(SDIO_BUS_WIDTH_4)))
		return err;
	sdioStruct.BusWide = SDIO_BUS_WIDE_4B;
	sdioStruct.ClockDiv = SDIO_CLK_24MHZ;
	SDIO_Init(SDIO, sdioStruct);

	/* Parse the CIS pointer of each Func */
	for (index = SDIO_FUNC_0; index < sdio_core.func_total_num; ++index)
		if ((err = sdio_get_cis_ptr(index, &cmd_resp)) ||
			(err = sdio_cis_parse(index, cmd_resp))
			)
			return err;

	/* Enable Func */
	for (index = SDIO_FUNC_1; index < sdio_core.func_total_num; ++index)
		if ((err = sdio_enable_func(index)))
			return err;

	/* Enable interrupts */
	if ((err = sdio_enable_mgr_int()))
		return err;
	for (index = SDIO_FUNC_1; index < sdio_core.func_total_num; ++index)
		if ((err = sdio_enable_func_int(index)))
			return err;

	/* Set the chunk size */
	for (index = SDIO_FUNC_1; index < sdio_core.func_total_num; ++index)
		if ((err = sdio_set_blk_size(index, SDIO_BLK_SIZE)))
			return err;

	return SDIO_ERR_OK;
}

/* Function name: sdio_get_cccr_version
 * Parameter: cccr_version(OUT) -> CCCR version
 * Return value: Returns the execution result
 * Description: Get the CCCR version by reading the CCCR register address 0x0
		|-7-|-6-|-5-|-4-|-3-|-2-|-1-|-0-|
		|--SDIO version-|-CCCR version--|
		00h CCCR/FBR defined in SDIO Version 1.00
		01h CCCR/FBR defined in SDIO Version 1.10
		02h CCCR/FBR defined in SDIO Version 2.00
		03h CCCR/FBR defined in SDIO Version 3.00
		04h-0Fh Reserved for future use
 */
uint8_t sdio_get_cccr_version(uint8_t *cccr_version)
{
	if (!cccr_version)
		return SDIO_ERR_INVALID_PARA;
	/* Read CCCR0 */
	uint8_t version;
	if (sdio_cmd52(SDIO_EXCU_READ, SDIO_FUNC_0, SDIO_CCCR_SDIO_VERSION, 0, &version))
		return SDIO_ERR_GET_VER_FAILED;
	*cccr_version = version & 0xF;
	return SDIO_ERR_OK;
}

/* Function name: sdio_get_sdio_version
 * Parameter: sdio_version(OUT) -> SDIO version
 * Return value: Returns the execution result
 * Description: Get the SDIO version by reading the CCCR register address 0x0
		|-7-|-6-|-5-|-4-|-3-|-2-|-1-|-0-|
		|--SDIO version-|-CCCR version--|
		00h SDIO Specification Version 1.00
		01h SDIO Specification Version 1.10
		02h SDIO Specification Version 1.20 (Unreleased)
		03h SDIO Specification Version 2.00
		04h SDIO Specification Version 3.00
		05h-0Fh Reserved for future use
 */
uint8_t sdio_get_sdio_version(uint8_t *sdio_version)
{
	if (!sdio_version)
		return SDIO_ERR_INVALID_PARA;
	/* Read CCCR0 */
	uint8_t version;
	if (sdio_cmd52(SDIO_EXCU_READ, SDIO_FUNC_0, SDIO_CCCR_SDIO_VERSION, 0, &version))
		return SDIO_ERR_GET_VER_FAILED;
	*sdio_version = version >> 4 & 0xF;
	return SDIO_ERR_OK;
}

