x893/STM32H747XIH6-CD/88W8801/marvell_wlan_host_driver/88w8801/sdio/88w8801_sdio.c
/* Function name: sdio_enable_func
 * Parameter: func_num(IN) -> Func number
 * Return value: Returns the execution result
 * Description: Enable the specified Func according to the Func number
 */
uint8_t sdio_enable_func(uint8_t func_num)
{
	if (func_num >= SDIO_FUNC_NUM)
		return SDIO_ERR_INVALID_PARA;
	/* Modify CCCR2 */
	uint8_t enable;
	if (sdio_cmd52(SDIO_EXCU_READ, SDIO_FUNC_0, SDIO_CCCR_IO_ENABLE, 0, &enable) ||
		sdio_cmd52(SDIO_EXCU_WRITE, SDIO_FUNC_0, SDIO_CCCR_IO_ENABLE, enable | 1 << func_num, NULL)
		)
		return SDIO_ERR_ENABLE_FUNC_FAILED;
	/* Waiting for Func to be ready */
	uint8_t ready = 0;
	while (!(ready & 1 << func_num))
		if (sdio_cmd52(SDIO_EXCU_READ, SDIO_FUNC_0, SDIO_CCCR_IO_READY, 0, &ready))
			return SDIO_ERR_ENABLE_FUNC_FAILED;
	/* Update Func status */
	(sdio_core.func + func_num)->func_status = SDIO_ENABLE;
	return SDIO_ERR_OK;
}

/* Function name: sdio_disable_func
 * Parameter: func_num(IN) -> Func number
 * Return value: Returns the execution result
 * Description: Disable the specified Func according to the Func number
 */
uint8_t sdio_disable_func(uint8_t func_num)
{
	if (func_num >= SDIO_FUNC_NUM)
		return SDIO_ERR_INVALID_PARA;

	/* Modify CCCR2 */
	uint8_t enable;
	if (sdio_cmd52(SDIO_EXCU_READ, SDIO_FUNC_0, SDIO_CCCR_IO_ENABLE, 0, &enable) ||
		sdio_cmd52(SDIO_EXCU_WRITE, SDIO_FUNC_0, SDIO_CCCR_IO_ENABLE, enable & ~(1 << func_num), NULL)
		)
		return SDIO_ERR_DISABLE_FUNC_FAILED;

	/* Update Func status */
	(sdio_core.func + func_num)->func_status = SDIO_DISABLE;
	return SDIO_ERR_OK;
}

/* Function name: sdio_enable_func_int
 * Parameter: func_num(IN) -> Func number
 * Return value: Returns the execution result
 * Description: Enable the specified Func interrupt according to the Func number
 */
uint8_t sdio_enable_func_int(uint8_t func_num)
{
	if (func_num >= SDIO_FUNC_NUM) return SDIO_ERR_INVALID_PARA;

	/* Modify CCCR4 */
	uint8_t enable;
	if (sdio_cmd52(SDIO_EXCU_READ, SDIO_FUNC_0, SDIO_CCCR_INT_ENABLE, 0, &enable) ||
		sdio_cmd52(SDIO_EXCU_WRITE, SDIO_FUNC_0, SDIO_CCCR_INT_ENABLE, enable | 1 << func_num, NULL)
		)
		return SDIO_ERR_ENABLE_FUNC_INT_FAILED;

	/* Update Func interrupt status */
	(sdio_core.func + func_num)->func_int_status = SDIO_ENABLE;
	return SDIO_ERR_OK;
}

/* Function name: sdio_disable_func_int
 * Parameter: func_num(IN) -> Func number
 * Return value: Returns the execution result
 * Description: Disable the specified Func interrupt according to the Func number
 */
uint8_t sdio_disable_func_int(uint8_t func_num)
{
	if (func_num >= SDIO_FUNC_NUM)
		return SDIO_ERR_INVALID_PARA;

	/* Modify CCCR4 */
	uint8_t enable;
	if (sdio_cmd52(SDIO_EXCU_READ, SDIO_FUNC_0, SDIO_CCCR_INT_ENABLE, 0, &enable) ||
		sdio_cmd52(SDIO_EXCU_WRITE, SDIO_FUNC_0, SDIO_CCCR_INT_ENABLE, enable & ~(1 << func_num), NULL)
		)
		return SDIO_ERR_DISABLE_FUNC_INT_FAILED;

	/* Update Func interrupt status */
	(sdio_core.func + func_num)->func_int_status = SDIO_DISABLE;
	return SDIO_ERR_OK;
}

/* Function name: sdio_enable_mgr_int
 * Parameters: NULL
 * Return value: Returns the execution result
 * Description: Enable CCCR interrupt master switch
 */
uint8_t sdio_enable_mgr_int(void)
{
	/* Modify CCCR4, the interrupt switch is located at bit 0 */
	uint8_t enable;
	if (sdio_cmd52(SDIO_EXCU_READ, SDIO_FUNC_0, SDIO_CCCR_INT_ENABLE, 0, &enable) ||
		sdio_cmd52(SDIO_EXCU_WRITE, SDIO_FUNC_0, SDIO_CCCR_INT_ENABLE, enable | 0x1, NULL)
		)
		return SDIO_ERR_ENABLE_MGR_INT_FAILED;

	/* Update interrupt master switch status */
	sdio_core.sdio_int_mgr = SDIO_ENABLE;
	return SDIO_ERR_OK;
}

/* Function name: sdio_disable_mgr_int
 * Parameters: NULL
 * Return value: Returns the execution result
 * Description: Disable CCCR interrupt master switch
 */
uint8_t sdio_disable_mgr_int(void)
{
	/* Modify CCCR4, the interrupt switch is located at bit 0 */
	uint8_t enable;
	if (sdio_cmd52(SDIO_EXCU_READ, SDIO_FUNC_0, SDIO_CCCR_INT_ENABLE, 0, &enable) ||
		sdio_cmd52(SDIO_EXCU_WRITE, SDIO_FUNC_0, SDIO_CCCR_INT_ENABLE, enable & ~0x1, NULL)
		)
		return SDIO_ERR_DISABLE_MGR_INT_FAILED;

	/* Update interrupt master switch status */
	sdio_core.sdio_int_mgr = SDIO_DISABLE;
	return SDIO_ERR_OK;
}

/* 函数名: sdio_get_int_pending
 * 参数: int_pending(OUT) -> 中断挂起状态
 * 返回值: 返回执行结果
 * 描述: 获取中断挂起状态 */
uint8_t sdio_get_int_pending(uint8_t *int_pending) {
	if (!int_pending) return SDIO_ERR_INVALID_PARA;
	/* 读取PENDING */
	if (sdio_cmd52(SDIO_EXCU_READ, SDIO_FUNC_0, SDIO_CCCR_INT_PENDING, 0, int_pending)) return SDIO_ERR_GET_PENDING_FAILED;
	return SDIO_ERR_OK;
}

/* 函数名: sdio_set_func_abort
 * 参数: func_num(IN) -> Func编号
 * 返回值: 返回执行结果
 * 描述: 终止指定Func */
uint8_t sdio_set_func_abort(uint8_t func_num) {
	if (func_num >= SDIO_FUNC_NUM) return SDIO_ERR_INVALID_PARA;
	/* 修改ABORT */
	uint8_t abort;
	if (sdio_cmd52(SDIO_EXCU_READ, SDIO_FUNC_0, SDIO_CCCR_IO_ABORT, 0, &abort) || sdio_cmd52(SDIO_EXCU_WRITE, SDIO_FUNC_0, SDIO_CCCR_IO_ABORT, abort | func_num, NULL)) return SDIO_ERR_SET_ABORT_FAILED;
	return SDIO_ERR_OK;
}

/* 函数名: sdio_reset
 * 参数: NULL
 * 返回值: 返回执行结果
 * 描述: 重置SDIO */
uint8_t sdio_reset(void) {
	/* 修改ABORT，重置标志位于bit3处 */
	uint8_t abort;
	if (sdio_cmd52(SDIO_EXCU_READ, SDIO_FUNC_0, SDIO_CCCR_IO_ABORT, 0, &abort) || sdio_cmd52(SDIO_EXCU_WRITE, SDIO_FUNC_0, SDIO_CCCR_IO_ABORT, abort | 0x8, NULL)) return SDIO_ERR_RESET_FAILED;
	return SDIO_ERR_OK;
}

/* 函数名: sdio_set_bus_width
 * 参数: bus_width(IN) -> 数据宽度
 * 返回值: 返回执行结果
 * 描述: 设置SDIO数据宽度
		00b: 1-bit
		01b: Reserved
		10b: 4-bit bus
		11b: 8-bit bus (Only for embedded SDIO) */
uint8_t sdio_set_bus_width(bus_width_e bus_width) {
	uint8_t width;
	if (sdio_cmd52(SDIO_EXCU_READ, SDIO_FUNC_0, SDIO_CCCR_BUS_CONTROL, 0, &width) || sdio_cmd52(SDIO_EXCU_WRITE, SDIO_FUNC_0, SDIO_CCCR_BUS_CONTROL, (width & ~0x3) | bus_width, NULL)) return SDIO_ERR_SET_BUS_WIDTH_FAILED;
	return SDIO_ERR_OK;
}

/* 函数名: sdio_get_bus_width
 * 参数: bus_width(OUT) -> 数据宽度
 * 返回值: 返回执行结果
 * 描述: 获取SDIO数据宽度
		00b: 1-bit
		01b: Reserved
		10b: 4-bit bus
		11b: 8-bit bus (Only for embedded SDIO) */
uint8_t sdio_get_bus_width(bus_width_e *bus_width) {
	if (!bus_width) return SDIO_ERR_INVALID_PARA;
	if (sdio_cmd52(SDIO_EXCU_READ, SDIO_FUNC_0, SDIO_CCCR_BUS_CONTROL, 0, bus_width)) return SDIO_ERR_GET_BUS_WIDTH_FAILED;
	return SDIO_ERR_OK;
}

/* 函数名: sdio_get_cis_ptr
 * 参数: func_num(IN) -> Func编号
		cis_ptr(OUT) -> CIS指针
 * 返回值: 返回执行结果
 * 描述: 根据Func编号获取CIS指针 */
uint8_t sdio_get_cis_ptr(uint8_t func_num, uint32_t *cis_ptr) {
	if (func_num >= SDIO_FUNC_NUM || !cis_ptr) return SDIO_ERR_INVALID_PARA;
	/* 组合0x9-0xB处数据得到CIS指针 */
	*cis_ptr = 0;
	for (uint8_t index = 0, ptr; index < 3; ++index) {
		if (sdio_cmd52(SDIO_EXCU_READ, SDIO_FUNC_0, SDIO_FBR_BASE(func_num) + SDIO_CCCR_CIS_PTR + index, 0, &ptr)) return SDIO_ERR_GET_CIS_PTR_FAILED;
		*cis_ptr |= ptr << index * 8;
	}
	return SDIO_ERR_OK;
}

/* 函数名: sdio_set_blk_size
 * 参数: func_num(IN) -> Func编号
		blk_size(IN) -> 分块大小
 * 返回值: 返回执行结果
 * 描述: 设置指定Func分块大小 */
uint8_t sdio_set_blk_size(uint8_t func_num, uint16_t blk_size) {
	/* 设置分块大小 */
	if (sdio_cmd52(SDIO_EXCU_WRITE, SDIO_FUNC_0, SDIO_FBR_BASE(func_num) + SDIO_CCCR_BLK_SIZE, (uint8_t)blk_size, NULL) || sdio_cmd52(SDIO_EXCU_WRITE, SDIO_FUNC_0, SDIO_FBR_BASE(func_num) + SDIO_CCCR_BLK_SIZE + 1, (uint8_t)(blk_size >> 8), NULL)) return SDIO_ERR_EMPTY_BLK_SIZE;
	/* 更新Func结构体 */
	(sdio_core.func + func_num)->cur_blk_size = blk_size;
	return SDIO_ERR_OK;
}

/* 函数名: sdio_get_blk_size
 * 参数: func_num(IN) -> Func编号
		blk_size(OUT) -> 分块大小
 * 返回值: 返回执行结果
 * 描述: 通过Func结构体获取分块大小 */
uint8_t sdio_get_blk_size(uint8_t func_num, uint16_t *blk_size) {
	if (!blk_size) return SDIO_ERR_INVALID_PARA;
	*blk_size = (sdio_core.func + func_num)->cur_blk_size;
	return SDIO_ERR_OK;
}

/* 函数名: sdio_cmd52
 * 参数: write(IN) -> 读/写操作
		func_num(IN) -> Func编号
		address(IN) -> 地址
		para(IN) -> 写入的参数
		resp(OUT) -> 读取的数据
 * 返回值: 返回执行结果
 * 描述: 执行CMD52 */
uint8_t sdio_cmd52(uint8_t write, uint8_t func_num, uint32_t address, uint8_t para, uint8_t *resp) {
	SDIO_CmdInitTypeDef sdioCmdStruct;
	sdioCmdStruct.Argument = write ? 0x80000000 : 0x0;
	sdioCmdStruct.Argument |= func_num << 28;
	sdioCmdStruct.Argument |= write && resp ? 0x8000000 : 0x0;
	sdioCmdStruct.Argument |= address << 9;
	sdioCmdStruct.Argument |= para;
	sdioCmdStruct.CmdIndex = SDIO_CMD52;
	sdioCmdStruct.CPSM = SDIO_CPSM_ENABLE;
	sdioCmdStruct.Response = SDIO_RESPONSE_SHORT;
	sdioCmdStruct.WaitForInterrupt = SDIO_WAIT_NO;
	SDIO_SendCommand(SDIO, &sdioCmdStruct);
	/* 等待命令发送 */
	while (__SDIO_GET_FLAG(SDIO, SDIO_FLAG_CMDACT));
	if (sdio_check_err()) return SDIO_ERR_CMD52_FAILED;
	if (!write && resp) *resp = (uint8_t)SDIO_GetResponse(SDIO, SDIO_RESP1);
	return SDIO_ERR_OK;
}

