x893/STM32H747XIH6-CD/88W8801/marvell_wlan_host_driver/88w8801/sdio/88w8801_sdio.c
/* 函数名: sdio_cmd53
 * 参数: write(IN) -> 读/写操作
		func_num(IN) -> Func编号
		address(IN) -> 地址
		inc_addr(IN) -> 地址是否累加
		buf(IN/OUT) -> 读/写缓冲区
		size(IN) -> 读/写数据长度
 * 返回值: 返回执行结果
 * 描述: 执行CMD53 */
uint8_t sdio_cmd53(uint8_t write, uint8_t func_num, uint32_t address, uint8_t inc_addr, uint8_t *buf, uint32_t size) {
	if (!(sdio_core.func + func_num)->cur_blk_size) return SDIO_ERR_EMPTY_BLK_SIZE;
	return write ? sdio_cmd53_write(func_num, address, inc_addr, buf, size, (sdio_core.func + func_num)->cur_blk_size) : sdio_cmd53_read(func_num, address, inc_addr, buf, size, (sdio_core.func + func_num)->cur_blk_size);
}

/* 函数名: sdio_cis_parse
 * 参数: func_num(IN) -> Func编号
		cis_ptr(IN) -> CIS指针
 * 返回值: 返回执行结果
 * 描述: 解析CIS并存入Func结构体中 */
static uint8_t sdio_cis_parse(uint8_t func_num, uint32_t cis_ptr) {
	// No SDIO card tuple can be longer than 257 bytes
	// 1 byte TPL_CODE + 1 byte TPL_LINK + FFh bytes tuple body
	uint8_t data[0xFF], tpl_code = CISTPL_NULL, tpl_link, index, len;
	while (tpl_code != CISTPL_END) {
		if (sdio_cmd52(SDIO_EXCU_READ, SDIO_FUNC_0, cis_ptr++, 0, &tpl_code)) return SDIO_ERR_CIS_PARSE_FAILED;
		if (tpl_code == CISTPL_NULL) continue;
		/* 本节点数据大小 */
		if (sdio_cmd52(SDIO_EXCU_READ, SDIO_FUNC_0, cis_ptr++, 0, &tpl_link)) return SDIO_ERR_CIS_PARSE_FAILED;
		for (index = 0; index < tpl_link; ++index) if (sdio_cmd52(SDIO_EXCU_READ, SDIO_FUNC_0, cis_ptr + index, 0, data + index)) return SDIO_ERR_CIS_PARSE_FAILED;
		switch (tpl_code) {
		case CISTPL_VERS_1:
			SDIO_DEBUG("Product Info:");
			for (index = 2; *(data + index) != 0xFF; index += len + 1) {
				len = strlen((char *)data + index);
				if (len) SDIO_DEBUG(" %s", data + index);
			}
			SDIO_DEBUG("\n");
			break;
		case CISTPL_MANFID:
			// 16.6 CISTPL_MANFID: Manufacturer Identification String Tuple
			// TPLMID_MANF
			SDIO_DEBUG("Manufacturer Code: 0x%04X\n", *(uint16_t *)data);
			sdio_core.manf_code = *(uint16_t *)data;
			// TPLMID_CARD
			SDIO_DEBUG("Manufacturer Info: 0x%04X\n", *(uint16_t *)(data + 2));
			sdio_core.manf_info = *(uint16_t *)(data + 2);
			break;
		case CISTPL_FUNCID:
			// 16.7.1 CISTPL_FUNCID: Function Identification Tuple
			// TPLFID_FUNCTION
			SDIO_DEBUG("Card Function Code: 0x%02X\n", *data);
			// TPLFID_SYSINIT
			SDIO_DEBUG("System Init Bit Mask: 0x%02X\n", *(data + 1));
			break;
		case CISTPL_FUNCE:
			// 16.7.2 CISTPL_FUNCE: Function Extension Tuple
			if (!*data) {
				// 16.7.3 CISTPL_FUNCE Tuple for Function 0 (Extended Data 00h)
				SDIO_DEBUG("Max Block Size Case1: Func %d, Size %d\n", func_num, *(uint16_t *)(data + 1));
				SDIO_DEBUG("Max Transfer Rate Code: 0x%02X\n", *(data + 3));
				(sdio_core.func + func_num)->max_blk_size = *(uint16_t *)(data + 1);
			}
			else {
				// 16.7.4 CISTPL_FUNCE Tuple for Function 1-7 (Extended Data 01h)
				// TPLFE_MAX_BLK_SIZE
				SDIO_DEBUG("Max Block Size Case2: Func %d, Size %d\n", func_num, *(uint16_t *)(data + 0xC));
				(sdio_core.func + func_num)->max_blk_size = *(uint16_t *)(data + 0xC);
			}
			break;
		default: SDIO_DEBUG("CIS Tuple 0x%02X: Addr 0x%08X, Size %d\n", tpl_code, cis_ptr - 2, tpl_link);
		}
		/* TPL_LINK为0xFF时说明当前节点为尾节点 */
		if (tpl_link == 0xFF) break;
		cis_ptr += tpl_link;
	}
	return SDIO_ERR_OK;
}

/* 函数名: sdio_set_dblocksize
 * 参数: dblock_size(OUT) -> 分块参数
		block_size(IN) -> 分块大小
 * 返回值: 返回执行结果
 * 描述: 将分块大小转换为分块参数 */
static uint8_t sdio_set_dblocksize(uint32_t *dblock_size, uint32_t block_size) {
	switch (block_size) {
	case 0x1: *dblock_size = SDIO_DATABLOCK_SIZE_1B; break;
	case 0x2: *dblock_size = SDIO_DATABLOCK_SIZE_2B; break;
	case 0x4: *dblock_size = SDIO_DATABLOCK_SIZE_4B; break;
	case 0x8: *dblock_size = SDIO_DATABLOCK_SIZE_8B; break;
	case 0x10: *dblock_size = SDIO_DATABLOCK_SIZE_16B; break;
	case 0x20: *dblock_size = SDIO_DATABLOCK_SIZE_32B; break;
	case 0x40: *dblock_size = SDIO_DATABLOCK_SIZE_64B; break;
	case 0x80: *dblock_size = SDIO_DATABLOCK_SIZE_128B; break;
	case 0x100: *dblock_size = SDIO_DATABLOCK_SIZE_256B; break;
	case 0x200: *dblock_size = SDIO_DATABLOCK_SIZE_512B; break;
	case 0x400: *dblock_size = SDIO_DATABLOCK_SIZE_1024B; break;
	case 0x800: *dblock_size = SDIO_DATABLOCK_SIZE_2048B; break;
	case 0x1000: *dblock_size = SDIO_DATABLOCK_SIZE_4096B; break;
	case 0x2000: *dblock_size = SDIO_DATABLOCK_SIZE_8192B; break;
	case 0x4000: *dblock_size = SDIO_DATABLOCK_SIZE_16384B;
	}
	return SDIO_ERR_OK;
}

/* 函数名: sdio_check_err
 * 参数: NULL
 * 返回值: 返回执行结果
 * 描述: 判断错误类型并清除对应标志 */
static uint8_t sdio_check_err(void) {
	uint8_t err = SDIO_ERR_OK;
	if (__SDIO_GET_FLAG(SDIO, SDIO_FLAG_CCRCFAIL)) {
		__SDIO_CLEAR_FLAG(SDIO, SDIO_FLAG_CCRCFAIL);
		++err;
		SDIO_DEBUG("Error: CMD%d CRC failed\n", (uint32_t)(SDIO->CMD & SDIO_CMD_CMDINDEX));
	}
	if (__SDIO_GET_FLAG(SDIO, SDIO_FLAG_CTIMEOUT)) {
		__SDIO_CLEAR_FLAG(SDIO, SDIO_FLAG_CTIMEOUT);
		++err;
		SDIO_DEBUG("Error: CMD%d timeout\n", (uint32_t)(SDIO->CMD & SDIO_CMD_CMDINDEX));
	}
	if (__SDIO_GET_FLAG(SDIO, SDIO_FLAG_DCRCFAIL)) {
		__SDIO_CLEAR_FLAG(SDIO, SDIO_FLAG_DCRCFAIL);
		++err;
		SDIO_DEBUG("Error: Data CRC failed\n");
	}
	if (__SDIO_GET_FLAG(SDIO, SDIO_FLAG_DTIMEOUT)) {
		__SDIO_CLEAR_FLAG(SDIO, SDIO_FLAG_DTIMEOUT);
		++err;
		SDIO_DEBUG("Error: Data timeout\n");
	}
	if (__SDIO_GET_FLAG(SDIO, SDIO_FLAG_TXUNDERR)) {
		__SDIO_CLEAR_FLAG(SDIO, SDIO_FLAG_TXUNDERR);
		++err;
		SDIO_DEBUG("Error: Data underrun\n");
	}
	if (__SDIO_GET_FLAG(SDIO, SDIO_FLAG_RXOVERR)) {
		__SDIO_CLEAR_FLAG(SDIO, SDIO_FLAG_RXOVERR);
		++err;
		SDIO_DEBUG("Error: Data overrun\n");
	}
	return err;
}

/* 函数名: sdio_cmd3
 * 参数: para(IN) -> CMD3参数
		resp(OUT) -> CMD3返回值
 * 返回值: 返回执行结果
 * 描述: 发送CMD3 */
static uint8_t sdio_cmd3(uint32_t para, uint32_t *resp) {
	SDIO_CmdInitTypeDef sdioCmdStruct;
	sdioCmdStruct.Argument = para;
	sdioCmdStruct.CmdIndex = SDIO_CMD3;
	sdioCmdStruct.Response = SDIO_RESPONSE_SHORT;
	sdioCmdStruct.WaitForInterrupt = SDIO_WAIT_NO;
	sdioCmdStruct.CPSM = SDIO_CPSM_ENABLE;
	SDIO_SendCommand(SDIO, &sdioCmdStruct);
	/* 等待命令发送 */
	while (__SDIO_GET_FLAG(SDIO, SDIO_FLAG_CMDACT));
	if (sdio_check_err()) return SDIO_ERR_CMD3_FAILED;
	if (resp) *resp = SDIO_GetResponse(SDIO, SDIO_RESP1);
	return SDIO_ERR_OK;
}

/* 函数名: sdio_cmd5
 * 参数: para(IN) -> CMD5参数
		resp(OUT) -> CMD5返回值
		retry_max(IN) -> 最大尝试次数
 * 返回值: 返回执行结果
 * 描述: 发送CMD5 */
static uint8_t sdio_cmd5(uint32_t para, uint32_t *resp, uint16_t retry_max) {
	SDIO_CmdInitTypeDef sdioCmdStruct;
	sdioCmdStruct.Argument = para;
	sdioCmdStruct.CmdIndex = SDIO_CMD5;
	sdioCmdStruct.Response = SDIO_RESPONSE_SHORT;
	sdioCmdStruct.WaitForInterrupt = SDIO_WAIT_NO;
	sdioCmdStruct.CPSM = SDIO_CPSM_ENABLE;
	for (uint16_t index = 0; index < retry_max; ++index) {
		SDIO_SendCommand(SDIO, &sdioCmdStruct);
		/* 等待命令发送 */
		while (__SDIO_GET_FLAG(SDIO, SDIO_FLAG_CMDACT));
		if (sdio_check_err()) continue;
		/* 判断是否成功 */
		para = SDIO_GetResponse(SDIO, SDIO_RESP1);
		if (!C_IN_R4(para)) continue;
		if (resp) *resp = para;
		return SDIO_ERR_OK;
	}
	return SDIO_ERR_CMD5_FAILED;
}

/* 函数名: sdio_cmd7
 * 参数: para(IN) -> CMD7参数
		resp(OUT) -> CMD7返回值
 * 返回值: 返回执行结果
 * 描述: 发送CMD7 */
static uint8_t sdio_cmd7(uint32_t para, uint32_t *resp) {
	SDIO_CmdInitTypeDef sdioCmdStruct;
	sdioCmdStruct.Argument = para;
	sdioCmdStruct.CmdIndex = SDIO_CMD7;
	sdioCmdStruct.Response = SDIO_RESPONSE_SHORT;
	sdioCmdStruct.WaitForInterrupt = SDIO_WAIT_NO;
	sdioCmdStruct.CPSM = SDIO_CPSM_ENABLE;
	SDIO_SendCommand(SDIO, &sdioCmdStruct);
	/* 等待命令发送 */
	while (__SDIO_GET_FLAG(SDIO, SDIO_FLAG_CMDACT));
	if (sdio_check_err()) return SDIO_ERR_CMD7_FAILED;
	if (resp) *resp = SDIO_GetResponse(SDIO, SDIO_RESP1);
	return SDIO_ERR_OK;
}

