x893/STM32H747XIH6-CD/88W8801/marvell_wlan_host_driver/88w8801/sdio/88w8801_sdio.c
/* 函数名: sdio_cmd53_read
 * 参数: func_num(IN) -> Func编号
		address(IN) -> 地址
		inc_addr(IN) -> 地址是否累加
		buf(OUT) -> 读取缓冲区
		size(IN) -> 读取数据长度
		cur_blk_size(IN) -> 当前Func分块大小
 * 返回值: 返回执行结果
 * 描述: 分块读取CMD53 */
static uint8_t sdio_cmd53_read(uint8_t func_num, uint32_t address, uint8_t inc_addr, uint8_t *buf, uint32_t size, uint16_t cur_blk_size) {
	uint8_t err = SDIO_ERR_OK;
	/* 开启DMA */
	LL_DMA_InitTypeDef dmaStruct = {};
	dmaStruct.Channel = LL_DMA_CHANNEL_4;
	dmaStruct.Direction = LL_DMA_DIRECTION_PERIPH_TO_MEMORY;
	dmaStruct.FIFOMode = LL_DMA_FIFOMODE_ENABLE;
	dmaStruct.FIFOThreshold = LL_DMA_FIFOTHRESHOLD_FULL;
	dmaStruct.MemBurst = LL_DMA_MBURST_INC4;
	dmaStruct.MemoryOrM2MDstDataSize = LL_DMA_MDATAALIGN_WORD;
	dmaStruct.Mode = LL_DMA_MODE_PFCTRL;
	dmaStruct.NbData = (size / cur_blk_size + (size % cur_blk_size ? 1 : 0)) * cur_blk_size / 4;
	dmaStruct.PeriphBurst = LL_DMA_PBURST_INC4;
	dmaStruct.PeriphOrM2MSrcAddress = (uint32_t)&SDIO->FIFO;
	dmaStruct.PeriphOrM2MSrcDataSize = LL_DMA_PDATAALIGN_WORD;
	dmaStruct.PeriphOrM2MSrcIncMode = LL_DMA_PERIPH_NOINCREMENT;
	dmaStruct.Priority = LL_DMA_PRIORITY_VERYHIGH;
	dmaStruct.MemoryOrM2MDstAddress = (uint32_t)buf;
	dmaStruct.MemoryOrM2MDstIncMode = LL_DMA_MEMORY_INCREMENT;
	LL_DMA_Init(DMA2, LL_DMA_STREAM_3, &dmaStruct);
	LL_DMA_EnableStream(DMA2, LL_DMA_STREAM_3);
	/* CMD53参数格式
	|-R/W Flag-|-Func Num-|-Blk Mode-|-OP Code-|-Reg Addr-|-Byte/Blk Cnt-|
	|--1 byte--|--3 bytes-|--1 byte--|--1 byte-|-17 bytes-|----9 bytes---| */
	SDIO_CmdInitTypeDef sdioCmdStruct = {};
	sdioCmdStruct.Argument = 0x0;
	sdioCmdStruct.Argument |= func_num << 28;
	sdioCmdStruct.Argument |= 0x8000000;
	/* OP Code: 1地址递增，0固定地址 */
	sdioCmdStruct.Argument |= inc_addr ? 0x4000000 : 0x0;
	sdioCmdStruct.Argument |= address << 9;
	sdioCmdStruct.Argument |= size / cur_blk_size + (size % cur_blk_size ? 1 : 0);
	sdioCmdStruct.CmdIndex = SDIO_CMD53;
	sdioCmdStruct.Response = SDIO_RESPONSE_SHORT;
	sdioCmdStruct.WaitForInterrupt = SDIO_WAIT_NO;
	sdioCmdStruct.CPSM = SDIO_CPSM_ENABLE;
	SDIO_SendCommand(SDIO, &sdioCmdStruct);
	/* 开始数据传输 */
	SDIO_DataInitTypeDef sdioDataStruct = {};
	sdioDataStruct.DataTimeOut = SDIO_DATATIMEOUT_24MHZ;
	sdioDataStruct.DataLength = (size / cur_blk_size + (size % cur_blk_size ? 1 : 0)) * cur_blk_size;
	sdio_set_dblocksize(&sdioDataStruct.DataBlockSize, cur_blk_size);
	sdioDataStruct.TransferDir = SDIO_TRANSFER_DIR_TO_SDIO;
	sdioDataStruct.TransferMode = SDIO_TRANSFER_MODE_BLOCK;
	sdioDataStruct.DPSM = SDIO_DPSM_ENABLE;
	SDIO_ConfigData(SDIO, &sdioDataStruct);
	/* 等待命令发送 */
	while (__SDIO_GET_FLAG(SDIO, SDIO_FLAG_CMDACT));
	if (sdio_check_err()) err = SDIO_ERR_CMD53_READ_FAILED;
	/* 等待数据传输 */
	while (!(err || __SDIO_GET_FLAG(SDIO, SDIO_FLAG_DATAEND))) if (sdio_check_err()) err = SDIO_ERR_CMD53_READ_FAILED;
	/* 清除命令响应/数据传输标志 */
	__SDIO_CLEAR_FLAG(SDIO, SDIO_FLAG_CMDREND | SDIO_FLAG_DATAEND | SDIO_FLAG_DBCKEND);
	/* 关闭DMA */
	LL_DMA_DeInit(DMA2, LL_DMA_STREAM_3);
	LL_DMA_DisableStream(DMA2, LL_DMA_STREAM_3);
	LL_DMA_ClearFlag_TC3(DMA2);
	return err;
}

/* Function name: sdio_cmd53_write
 * Parameter: func_num(IN) -> Func number
		address(IN) -> address
		inc_addr(IN) -> Is the address cumulative?
		buf(IN) -> Write buffer
		size(IN) -> Write data length
		cur_blk_size(IN) -> Current Func block size
 * Return value: Returns the execution result
 * Description: Write CMD53 in blocks
 */
static uint8_t sdio_cmd53_write(
	uint8_t func_num,
	uint32_t address,
	uint8_t inc_addr,
	uint8_t *buf,
	uint32_t size,
	uint16_t cur_blk_size
	)
{
	uint8_t err = SDIO_ERR_OK;
	/* CMD53 parameter format
	|-R/W Flag-|-Func Num-|-Blk Mode-|-OP Code-|-Reg Addr-|-Byte/Blk Cnt-|
	|--1 byte--|--3 bytes-|--1 byte--|--1 byte-|-17 bytes-|----9 bytes---|
	*/
	SDIO_CmdInitTypeDef sdioCmdStruct = {};
	sdioCmdStruct.Argument = 0x80000000;
	sdioCmdStruct.Argument |= func_num << 28;
	sdioCmdStruct.Argument |= 0x8000000;

	/* OP Code: 1 address increment, 0 fixed address */
	sdioCmdStruct.Argument |= inc_addr ? 0x4000000 : 0x0;
	sdioCmdStruct.Argument |= address << 9;
	sdioCmdStruct.Argument |= size / cur_blk_size + (size % cur_blk_size ? 1 : 0);
	sdioCmdStruct.CmdIndex = SDIO_CMD53;
	sdioCmdStruct.Response = SDIO_RESPONSE_SHORT;
	sdioCmdStruct.WaitForInterrupt = SDIO_WAIT_NO;
	sdioCmdStruct.CPSM = SDIO_CPSM_ENABLE;
	SDIO_SendCommand(SDIO, &sdioCmdStruct);

	/* Waiting for command response */
	while (!(err || __SDIO_GET_FLAG(SDIO, SDIO_FLAG_CMDREND)))
		if (sdio_check_err())
			err = SDIO_ERR_CMD53_WRITE_FAILED;

	/* Clear command response flag */
	__SDIO_CLEAR_FLAG(SDIO, SDIO_FLAG_CMDREND);
	/* Enable DMA */
	LL_DMA_InitTypeDef dmaStruct = {};
	dmaStruct.Channel = LL_DMA_CHANNEL_4;
	dmaStruct.Direction = LL_DMA_DIRECTION_MEMORY_TO_PERIPH;
	dmaStruct.FIFOMode = LL_DMA_FIFOMODE_ENABLE;
	dmaStruct.FIFOThreshold = LL_DMA_FIFOTHRESHOLD_FULL;
	dmaStruct.MemBurst = LL_DMA_MBURST_INC4;
	dmaStruct.MemoryOrM2MDstDataSize = LL_DMA_MDATAALIGN_WORD;
	dmaStruct.Mode = LL_DMA_MODE_PFCTRL;
	dmaStruct.NbData = (size / cur_blk_size + (size % cur_blk_size ? 1 : 0)) * cur_blk_size / 4;
	dmaStruct.PeriphBurst = LL_DMA_PBURST_INC4;
	dmaStruct.PeriphOrM2MSrcAddress = (uint32_t)&SDIO->FIFO;
	dmaStruct.PeriphOrM2MSrcDataSize = LL_DMA_PDATAALIGN_WORD;
	dmaStruct.PeriphOrM2MSrcIncMode = LL_DMA_PERIPH_NOINCREMENT;
	dmaStruct.Priority = LL_DMA_PRIORITY_VERYHIGH;
	dmaStruct.MemoryOrM2MDstAddress = (uint32_t)buf;
	dmaStruct.MemoryOrM2MDstIncMode = LL_DMA_MEMORY_INCREMENT;
	LL_DMA_Init(DMA2, LL_DMA_STREAM_3, &dmaStruct);
	LL_DMA_EnableStream(DMA2, LL_DMA_STREAM_3);

	/* Start data transfer */
	SDIO_DataInitTypeDef sdioDataStruct = {};
	sdioDataStruct.DataTimeOut = SDIO_DATATIMEOUT_24MHZ;
	sdioDataStruct.DataLength = (size / cur_blk_size + (size % cur_blk_size ? 1 : 0)) * cur_blk_size;
	sdio_set_dblocksize(&sdioDataStruct.DataBlockSize, cur_blk_size);
	sdioDataStruct.TransferDir = SDIO_TRANSFER_DIR_TO_CARD;
	sdioDataStruct.TransferMode = SDIO_TRANSFER_MODE_BLOCK;
	sdioDataStruct.DPSM = SDIO_DPSM_ENABLE;
	SDIO_ConfigData(SDIO, &sdioDataStruct);

	/* Waiting for data transfer */
	while (!(err || __SDIO_GET_FLAG(SDIO, SDIO_FLAG_DATAEND)))
		if (sdio_check_err())
			err = SDIO_ERR_CMD53_WRITE_FAILED;

	/* Clear data transfer flag */
	__SDIO_CLEAR_FLAG(SDIO, SDIO_FLAG_DATAEND | SDIO_FLAG_DBCKEND);
	/* Turn off DMA */
	LL_DMA_DeInit(DMA2, LL_DMA_STREAM_3);
	LL_DMA_DisableStream(DMA2, LL_DMA_STREAM_3);
	LL_DMA_ClearFlag_TC3(DMA2);
	return err;
}
